#language:ru
Функционал: Тестовый

  Сценарий: Тестовый

    Когда Нажимаем на Sign in
    И Вводим Логин
    И Вводим Пароль
    И нажимаем на вход
    И проверяем что мы прошли регистрацию

    Когда выбираем случайную тему
    И нажимаем на всплывающее окно подписаться

    Когда выбираем случайную тему
    И нажимаем на всплывающее окно подписаться

    Когда нажимаем на подписки

    Когда нажимаем на вкладку активные
    И проверяем значение ссылки
    И нажимаем на неактивные
    И нажимаем на вкладку все
    И нажимаем на подписки

    Когда нажимаем на вкладку активные
    И проверяем значение ссылки
    И нажимаем на неактивные

